Synwit-Co-Ltd/SWM160/SWM160_Lib/SWM160_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM160.h
#define SYS_SLEEP_SLEEP_Pos			0		//将该位置1后，系统将进入SLEEP模式
#define SYS_SLEEP_SLEEP_Msk			(0x01 << SYS_SLEEP_SLEEP_Pos)
#define SYS_SLEEP_STOP_Pos			1		//将该位置1后，系统将进入STOP 模式
#define SYS_SLEEP_STOP_Msk			(0x01 << SYS_SLEEP_STOP_Pos)

#define SYS_RTCWK_EN_Pos			0
#define SYS_RTCWK_EN_Msk			(0x01 << SYS_RTCWK_EN_Pos)
#define SYS_RTCWK_ST_Pos			1		//RTC唤醒状态标志位，写1清
#define SYS_RTCWK_ST_Msk			(0x01 << SYS_RTCWK_ST_Pos)

#define SYS_RSTST_POR_Pos			0		//1 表示出现过POR复位，写1清零
#define SYS_RSTST_POR_Msk			(0x01 << SYS_RSTST_POR_Pos)
#define SYS_RSTST_WDT_Pos			3		//1 表示出现过WDT复位，写1清零
#define SYS_RSTST_WDT_Msk			(0x01 << SYS_RSTST_WDT_Pos)

#define SYS_HRCCR_EN_Pos			0		//High speed RC Enable
#define SYS_HRCCR_EN_Msk			(0x01 << SYS_HRCCR_EN_Pos)
#define SYS_HRCCR_DBL_Pos		    1		//Double Frequency	0 24MHz	1 48MHz
#define SYS_HRCCR_DBL_Msk		    (0x01 << SYS_HRCCR_DBL_Pos)

#define SYS_BODCR_INTEN_Pos			1		//BOD中断使能
#define SYS_BODCR_INTEN_Msk			(0x01 << SYS_BODCR_INTEN_Pos)
#define SYS_BODCR_INTST_Pos			2		//BOD中断状态，只读
#define SYS_BODCR_INTST_Msk			(0x01 << SYS_BODCR_INTST_Pos)
#define SYS_BODCR_RSTLVL_Pos		4		//BOD复位电平，0 2.0V产生复位   1 1.7V产生复位
#define SYS_BODCR_RSTLVL_Msk		(0x01 << SYS_BODCR_RSTLVL_Pos)
#define SYS_BODCR_INTLVL_Pos		5		//BOD中断电平，0 2.7V产生中断   1 2.3V产生中断   2 2.0V产生中断
#define SYS_BODCR_INTLVL_Msk		(0x03 << SYS_BODCR_INTLVL_Pos)

#define SYS_XTALCR_EN_Pos		    1
#define SYS_XTALCR_EN_Msk		    (0x01 << SYS_XTALCR_EN_Pos)

#define SYS_LRCCR_EN_Pos			0		//Low Speed RC Enable
#define SYS_LRCCR_EN_Msk			(0x01 << SYS_LRCCR_EN_Pos)




typedef struct {
	__IO uint32_t FUNSEL;
	
		 uint32_t RESERVED[127];
	
	__IO uint32_t PULLU;                    //PULLU[n]为 PINn引脚 上拉使能位： 1 上拉使能	0 上拉禁止
	
		 uint32_t RESERVED2[63];
	
	__IO uint32_t PULLD;                    //PULLD[n]为 PINn引脚 下拉使能位： 1 下拉使能	0 下拉禁止
	
		 uint32_t RESERVED3[63];
	
	__IO uint32_t OPEND;                    //OPEND[n]为 PINn引脚 开漏使能位： 1 开漏使能	0 开漏禁止
	
		 uint32_t RESERVED4[127];
	
	__IO uint32_t INEN;                     //INEN[n] 为 PINn引脚 输入使能位： 1 输入使能	0 输入禁止
} PORT_TypeDef;


#define PORT_FUNSEL_PIN0_Pos		0
#define PORT_FUNSEL_PIN0_Msk		(0x01 << PORT_FUNSEL_PIN0_Pos)
#define PORT_FUNSEL_PIN1_Pos		1
#define PORT_FUNSEL_PIN1_Msk		(0x01 << PORT_FUNSEL_PIN1_Pos)
#define PORT_FUNSEL_PIN2_Pos		2
#define PORT_FUNSEL_PIN2_Msk		(0x01 << PORT_FUNSEL_PIN2_Pos)
#define PORT_FUNSEL_PIN3_Pos		3
#define PORT_FUNSEL_PIN3_Msk		(0x01 << PORT_FUNSEL_PIN3_Pos)
#define PORT_FUNSEL_PIN4_Pos		4
#define PORT_FUNSEL_PIN4_Msk		(0x01 << PORT_FUNSEL_PIN4_Pos)
#define PORT_FUNSEL_PIN5_Pos		5
#define PORT_FUNSEL_PIN5_Msk		(0x01 << PORT_FUNSEL_PIN5_Pos)
#define PORT_FUNSEL_PIN6_Pos		6
#define PORT_FUNSEL_PIN6_Msk		(0x01 << PORT_FUNSEL_PIN6_Pos)
#define PORT_FUNSEL_PIN7_Pos		7
#define PORT_FUNSEL_PIN7_Msk		(0x01 << PORT_FUNSEL_PIN7_Pos)
#define PORT_FUNSEL_PIN8_Pos		8
#define PORT_FUNSEL_PIN8_Msk		(0x01 << PORT_FUNSEL_PIN8_Pos)
#define PORT_FUNSEL_PIN9_Pos		9
#define PORT_FUNSEL_PIN9_Msk		(0x01 << PORT_FUNSEL_PIN9_Pos)
#define PORT_FUNSEL_PIN10_Pos		10
#define PORT_FUNSEL_PIN10_Msk		(0x01 << PORT_FUNSEL_PIN10_Pos)
#define PORT_FUNSEL_PIN11_Pos		11
#define PORT_FUNSEL_PIN11_Msk		(0x01 << PORT_FUNSEL_PIN11_Pos)
#define PORT_FUNSEL_PIN12_Pos		12
#define PORT_FUNSEL_PIN12_Msk		(0x01 << PORT_FUNSEL_PIN12_Pos)
#define PORT_FUNSEL_PIN13_Pos		13
#define PORT_FUNSEL_PIN13_Msk		(0x01 << PORT_FUNSEL_PIN13_Pos)
#define PORT_FUNSEL_PIN14_Pos		14
#define PORT_FUNSEL_PIN14_Msk		(0x01 << PORT_FUNSEL_PIN14_Pos)
#define PORT_FUNSEL_PIN15_Pos		15
#define PORT_FUNSEL_PIN15_Msk		(0x01 << PORT_FUNSEL_PIN15_Pos)

#define PORT_PULLU_PIN0_Pos			0
#define PORT_PULLU_PIN0_Msk			(0x01 << PORT_PULLU_PIN0_Pos)
#define PORT_PULLU_PIN1_Pos			1
#define PORT_PULLU_PIN1_Msk			(0x01 << PORT_PULLU_PIN1_Pos)
#define PORT_PULLU_PIN2_Pos			2
#define PORT_PULLU_PIN2_Msk			(0x01 << PORT_PULLU_PIN2_Pos)
#define PORT_PULLU_PIN3_Pos			3
#define PORT_PULLU_PIN3_Msk			(0x01 << PORT_PULLU_PIN3_Pos)
#define PORT_PULLU_PIN4_Pos			4
#define PORT_PULLU_PIN4_Msk			(0x01 << PORT_PULLU_PIN4_Pos)
#define PORT_PULLU_PIN5_Pos			5
#define PORT_PULLU_PIN5_Msk			(0x01 << PORT_PULLU_PIN5_Pos)
#define PORT_PULLU_PIN6_Pos			6
#define PORT_PULLU_PIN6_Msk			(0x01 << PORT_PULLU_PIN6_Pos)
#define PORT_PULLU_PIN7_Pos			7
#define PORT_PULLU_PIN7_Msk			(0x01 << PORT_PULLU_PIN7_Pos)
#define PORT_PULLU_PIN8_Pos			8
#define PORT_PULLU_PIN8_Msk			(0x01 << PORT_PULLU_PIN8_Pos)
#define PORT_PULLU_PIN9_Pos			9
#define PORT_PULLU_PIN9_Msk			(0x01 << PORT_PULLU_PIN9_Pos)
#define PORT_PULLU_PIN10_Pos		10
#define PORT_PULLU_PIN10_Msk		(0x01 << PORT_PULLU_PIN10_Pos)
#define PORT_PULLU_PIN11_Pos		11
#define PORT_PULLU_PIN11_Msk		(0x01 << PORT_PULLU_PIN11_Pos)
#define PORT_PULLU_PIN12_Pos		12
#define PORT_PULLU_PIN12_Msk		(0x01 << PORT_PULLU_PIN12_Pos)
#define PORT_PULLU_PIN13_Pos		13
#define PORT_PULLU_PIN13_Msk		(0x01 << PORT_PULLU_PIN13_Pos)
#define PORT_PULLU_PIN14_Pos		14
#define PORT_PULLU_PIN14_Msk		(0x01 << PORT_PULLU_PIN14_Pos)
#define PORT_PULLU_PIN15_Pos		15
#define PORT_PULLU_PIN15_Msk		(0x01 << PORT_PULLU_PIN15_Pos)

#define PORT_PULLD_PIN0_Pos			0
#define PORT_PULLD_PIN0_Msk			(0x01 << PORT_PULLD_PIN0_Pos)
#define PORT_PULLD_PIN1_Pos			1
#define PORT_PULLD_PIN1_Msk			(0x01 << PORT_PULLD_PIN1_Pos)
#define PORT_PULLD_PIN2_Pos			2
#define PORT_PULLD_PIN2_Msk			(0x01 << PORT_PULLD_PIN2_Pos)
#define PORT_PULLD_PIN3_Pos			3
#define PORT_PULLD_PIN3_Msk			(0x01 << PORT_PULLD_PIN3_Pos)
#define PORT_PULLD_PIN4_Pos			4
#define PORT_PULLD_PIN4_Msk			(0x01 << PORT_PULLD_PIN4_Pos)
#define PORT_PULLD_PIN5_Pos			5
#define PORT_PULLD_PIN5_Msk			(0x01 << PORT_PULLD_PIN5_Pos)
#define PORT_PULLD_PIN6_Pos			6
#define PORT_PULLD_PIN6_Msk			(0x01 << PORT_PULLD_PIN6_Pos)
#define PORT_PULLD_PIN7_Pos			7
#define PORT_PULLD_PIN7_Msk			(0x01 << PORT_PULLD_PIN7_Pos)
#define PORT_PULLD_PIN8_Pos			8
#define PORT_PULLD_PIN8_Msk			(0x01 << PORT_PULLD_PIN8_Pos)
#define PORT_PULLD_PIN9_Pos			9
#define PORT_PULLD_PIN9_Msk			(0x01 << PORT_PULLD_PIN9_Pos)
#define PORT_PULLD_PIN10_Pos		10
#define PORT_PULLD_PIN10_Msk		(0x01 << PORT_PULLD_PIN10_Pos)
#define PORT_PULLD_PIN11_Pos		11
#define PORT_PULLD_PIN11_Msk		(0x01 << PORT_PULLD_PIN11_Pos)
#define PORT_PULLD_PIN12_Pos		12
#define PORT_PULLD_PIN12_Msk		(0x01 << PORT_PULLD_PIN12_Pos)
#define PORT_PULLD_PIN13_Pos		13
#define PORT_PULLD_PIN13_Msk		(0x01 << PORT_PULLD_PIN13_Pos)
#define PORT_PULLD_PIN14_Pos		14
#define PORT_PULLD_PIN14_Msk		(0x01 << PORT_PULLD_PIN14_Pos)
#define PORT_PULLD_PIN15_Pos		15
#define PORT_PULLD_PIN15_Msk		(0x01 << PORT_PULLD_PIN15_Pos)

#define PORT_OPEND_PIN0_Pos			0
#define PORT_OPEND_PIN0_Msk			(0x01 << PORT_OPEND_PIN0_Pos)
#define PORT_OPEND_PIN1_Pos			1
#define PORT_OPEND_PIN1_Msk			(0x01 << PORT_OPEND_PIN1_Pos)
#define PORT_OPEND_PIN2_Pos			2
#define PORT_OPEND_PIN2_Msk			(0x01 << PORT_OPEND_PIN2_Pos)
#define PORT_OPEND_PIN3_Pos			3
#define PORT_OPEND_PIN3_Msk			(0x01 << PORT_OPEND_PIN3_Pos)
#define PORT_OPEND_PIN4_Pos			4
#define PORT_OPEND_PIN4_Msk			(0x01 << PORT_OPEND_PIN4_Pos)
#define PORT_OPEND_PIN5_Pos			5
#define PORT_OPEND_PIN5_Msk			(0x01 << PORT_OPEND_PIN5_Pos)
#define PORT_OPEND_PIN6_Pos			6
#define PORT_OPEND_PIN6_Msk			(0x01 << PORT_OPEND_PIN6_Pos)
#define PORT_OPEND_PIN7_Pos			7
#define PORT_OPEND_PIN7_Msk			(0x01 << PORT_OPEND_PIN7_Pos)
#define PORT_OPEND_PIN8_Pos			8
#define PORT_OPEND_PIN8_Msk			(0x01 << PORT_OPEND_PIN8_Pos)
#define PORT_OPEND_PIN9_Pos			9
#define PORT_OPEND_PIN9_Msk			(0x01 << PORT_OPEND_PIN9_Pos)
#define PORT_OPEND_PIN10_Pos		10
#define PORT_OPEND_PIN10_Msk		(0x01 << PORT_OPEND_PIN10_Pos)
#define PORT_OPEND_PIN11_Pos		11
#define PORT_OPEND_PIN11_Msk		(0x01 << PORT_OPEND_PIN11_Pos)
#define PORT_OPEND_PIN12_Pos		12
#define PORT_OPEND_PIN12_Msk		(0x01 << PORT_OPEND_PIN12_Pos)
#define PORT_OPEND_PIN13_Pos		13
#define PORT_OPEND_PIN13_Msk		(0x01 << PORT_OPEND_PIN13_Pos)
#define PORT_OPEND_PIN14_Pos		14
#define PORT_OPEND_PIN14_Msk		(0x01 << PORT_OPEND_PIN14_Pos)
#define PORT_OPEND_PIN15_Pos		15
#define PORT_OPEND_PIN15_Msk		(0x01 << PORT_OPEND_PIN15_Pos)

