Synwit-Co-Ltd/SWM160/SWM160_Lib/SWM160_StdPeriph_Driver/CSL/CMSIS/DeviceSupport/SWM160.h
	__IO uint32_t IF3;
	
		 uint32_t RESERVED5[4];
		 
	__IO uint32_t IE0;						//中断使能=0，不产生IF信号
	
	__IO uint32_t IE1;
	
	__IO uint32_t IE2;
	
	__IO uint32_t IE3;
	
		 uint32_t RESERVED6[4];
		 
	__IO uint32_t IM0;						//中断屏蔽=1，就算有IF信号，也不输出到内核触发中断
	
	__IO uint32_t IM1;
	
	__IO uint32_t IM2;
	
	__IO uint32_t IM3;
	
		 uint32_t RESERVED7[4];
		 
	__IO uint32_t OCMAT0;					//Output Compare Match Register for Timer0，输出比较模式下TIMR只有16位，[15:0] 为第一个翻转点匹配值   [31:16] 为第二个翻转点匹配值
	
	__IO uint32_t OCMAT1;
	
	__IO uint32_t OCMAT2;
	
	__IO uint32_t OCMAT3;
	
		 uint32_t RESERVED8[4];
		 
	__IO uint32_t OCEN;						//Output Compare Enabel
	
	__IO uint32_t OCMSK;					//Output Compare Maks，屏蔽后引脚输出电平由TIMRx->CTRL.OC_MSKLVL决定
	
		 uint32_t RESERVED9[14];
		 
	__IO uint32_t ICVAL0H;					//Input Capture High Level Value for Timer0，24位
	
	__IO uint32_t ICVAL0L;					//Input Capture Low Level Value for Timer0，24位
	
	__IO uint32_t ICVAL1H;
	
	__IO uint32_t ICVAL1L;
	
	__IO uint32_t ICVAL2H;
	
	__IO uint32_t ICVAL2L;
	
	__IO uint32_t ICVAL3H;
	
	__IO uint32_t ICVAL3L;
} TIMRG_TypeDef;


#define TIMRG_ICCR_GO0_Pos			0		//Timer0测量启动 1：开始测量    0：停止测量
#define TIMRG_ICCR_GO0_Msk			(0x01 << TIMRG_ICCR_GO0_Pos)
#define TIMRG_ICCR_POL0_Pos			1		//Timer0测量起始极性 1 测量高电平起始    0 测量低电平起始
#define TIMRG_ICCR_POL0_Msk			(0x01 << TIMRG_ICCR_POL0_Pos)
#define TIMRG_ICCR_EN0_Pos			2		//Timer0测量功能使能
#define TIMRG_ICCR_EN0_Msk			(0x01 << TIMRG_ICCR_EN0_Pos)
#define TIMRG_ICCR_GO1_Pos			4		//Timer1测量启动
#define TIMRG_ICCR_GO1_Msk			(0x01 << TIMRG_ICCR_GO1_Pos)
#define TIMRG_ICCR_POL1_Pos			5		//Timer1测量起始极性
#define TIMRG_ICCR_POL1_Msk			(0x01 << TIMRG_ICCR_POL1_Pos)
#define TIMRG_ICCR_EN1_Pos			6		//Timer1测量功能使能
#define TIMRG_ICCR_EN1_Msk			(0x01 << TIMRG_ICCR_EN1_Pos)
#define TIMRG_ICCR_GO2_Pos			8
#define TIMRG_ICCR_GO2_Msk			(0x01 << TIMRG_ICCR_GO2_Pos)
#define TIMRG_ICCR_POL2_Pos			9
#define TIMRG_ICCR_POL2_Msk			(0x01 << TIMRG_ICCR_POL2_Pos)
#define TIMRG_ICCR_EN2_Pos			10
#define TIMRG_ICCR_EN2_Msk			(0x01 << TIMRG_ICCR_EN2_Pos)
#define TIMRG_ICCR_GO3_Pos			12
#define TIMRG_ICCR_GO3_Msk			(0x01 << TIMRG_ICCR_GO3_Pos)
#define TIMRG_ICCR_POL3_Pos			13
#define TIMRG_ICCR_POL3_Msk			(0x01 << TIMRG_ICCR_POL3_Pos)
#define TIMRG_ICCR_EN3_Pos			14
#define TIMRG_ICCR_EN3_Msk			(0x01 << TIMRG_ICCR_EN3_Pos)

#define TIMRG_HALT_TIMR0_Pos		0		//1 暂停计数
#define TIMRG_HALT_TIMR0_Msk		(0x01 << TIMRG_HALT_TIMR0_Pos)
#define TIMRG_HALT_TIMR1_Pos		1
#define TIMRG_HALT_TIMR1_Msk		(0x01 << TIMRG_HALT_TIMR1_Pos)
#define TIMRG_HALT_TIMR2_Pos		2
#define TIMRG_HALT_TIMR2_Msk		(0x01 << TIMRG_HALT_TIMR2_Pos)
#define TIMRG_HALT_TIMR3_Pos		3
#define TIMRG_HALT_TIMR3_Msk		(0x01 << TIMRG_HALT_TIMR3_Pos)

#define TIMRG_HALLCR_IEA_Pos		0		//0 霍尔信号A禁止中断    1 上升沿产生中断    2 下降沿产生中断    3 双边沿产生中断		
#define TIMRG_HALLCR_IEA_Msk		(0x03 << TIMRG_HALLCR_IEA_Pos)
#define TIMRG_HALLCR_IEB_Pos		2
#define TIMRG_HALLCR_IEB_Msk		(0x03 << TIMRG_HALLCR_IEB_Pos)
#define TIMRG_HALLCR_IEC_Pos		4
#define TIMRG_HALLCR_IEC_Msk		(0x03 << TIMRG_HALLCR_IEC_Pos)

#define TIMRG_HALLSR_IFA_Pos		0		//霍尔信号A中断标志，写1清零	
#define TIMRG_HALLSR_IFA_Msk		(0x01 << TIMRG_HALLSR_IFA_Pos)
#define TIMRG_HALLSR_IFB_Pos		1
#define TIMRG_HALLSR_IFB_Msk		(0x01 << TIMRG_HALLSR_IFB_Pos)
#define TIMRG_HALLSR_IFC_Pos		2
#define TIMRG_HALLSR_IFC_Msk		(0x01 << TIMRG_HALLSR_IFC_Pos)
#define TIMRG_HALLSR_STA_Pos		3		//霍尔信号A状态标志位
#define TIMRG_HALLSR_STA_Msk		(0x01 << TIMRG_HALLSR_STA_Pos)
#define TIMRG_HALLSR_STB_Pos		4
#define TIMRG_HALLSR_STB_Msk		(0x01 << TIMRG_HALLSR_STB_Pos)
#define TIMRG_HALLSR_STC_Pos		5
#define TIMRG_HALLSR_STC_Msk		(0x01 << TIMRG_HALLSR_STC_Pos)

#define TIMRG_IF_IF_Pos				0		//定时器递减至0中断，即一个定时周期，写1清零
#define TIMRG_IF_IF_Msk				(0x01 << TIMRG_IF_IF_Pos)
#define TIMRG_IF_OCMAT1_Pos			1		//Output Compare Match 1
#define TIMRG_IF_OCMAT1_Msk			(0x01 << TIMRG_IF_OCMAT1_Pos)
#define TIMRG_IF_OCMAT2_Pos			2		//Output Compare Match 2
#define TIMRG_IF_OCMAT2_Msk			(0x01 << TIMRG_IF_OCMAT2_Pos)
#define TIMRG_IF_ICH_Pos			8		//Input Capture High Level
#define TIMRG_IF_ICH_Msk			(0x01 << TIMRG_IF_ICH_Pos)
#define TIMRG_IF_ICL_Pos			9		//Input Capture Low Level
#define TIMRG_IF_ICL_Msk			(0x01 << TIMRG_IF_ICL_Pos)
#define TIMRG_IF_ICOV_Pos			10		//Input Capture Overflow
#define TIMRG_IF_ICOV_Msk			(0x01 << TIMRG_IF_ICOV_Pos)
#define TIMRG_IF_HALL_Pos			16
#define TIMRG_IF_HALL_Msk			(0x01 << TIMRG_IF_HALL_Pos)

#define TIMRG_IE_IF_Pos				0		//定时器递减至0中断，即一个定时周期
#define TIMRG_IE_IF_Msk				(0x01 << TIMRG_IE_IF_Pos)
#define TIMRG_IE_OCMAT1_Pos			1		//Output Compare Match 1
#define TIMRG_IE_OCMAT1_Msk			(0x01 << TIMRG_IE_OCMAT1_Pos)
#define TIMRG_IE_OCMAT2_Pos			2		//Output Compare Match 2
#define TIMRG_IE_OCMAT2_Msk			(0x01 << TIMRG_IE_OCMAT2_Pos)
#define TIMRG_IE_ICH_Pos			8		//Input Capture High Level
#define TIMRG_IE_ICH_Msk			(0x01 << TIMRG_IE_ICH_Pos)
#define TIMRG_IE_ICL_Pos			9		//Input Capture Low Level
#define TIMRG_IE_ICL_Msk			(0x01 << TIMRG_IE_ICL_Pos)
#define TIMRG_IE_ICOV_Pos			10		//Input Capture Overflow
#define TIMRG_IE_ICOV_Msk			(0x01 << TIMRG_IE_ICOV_Pos)
#define TIMRG_IE_HALL_Pos			16
#define TIMRG_IE_HALL_Msk			(0x01 << TIMRG_IE_HALL_Pos)

#define TIMRG_IM_IF_Pos				0		//定时器递减至0中断，即一个定时周期
#define TIMRG_IM_IF_Msk				(0x01 << TIMRG_IM_IF_Pos)
#define TIMRG_IM_OCMAT1_Pos			1		//Output Compare Match 1
#define TIMRG_IM_OCMAT1_Msk			(0x01 << TIMRG_IM_OCMAT1_Pos)
#define TIMRG_IM_OCMAT2_Pos			2		//Output Compare Match 2
#define TIMRG_IM_OCMAT2_Msk			(0x01 << TIMRG_IM_OCMAT2_Pos)
#define TIMRG_IM_ICH_Pos			8		//Input Capture High Level
#define TIMRG_IM_ICH_Msk			(0x01 << TIMRG_IM_ICH_Pos)
#define TIMRG_IM_ICL_Pos			9		//Input Capture Low Level
#define TIMRG_IM_ICL_Msk			(0x01 << TIMRG_IM_ICL_Pos)
#define TIMRG_IM_ICOV_Pos			10		//Input Capture Overflow
#define TIMRG_IM_ICOV_Msk			(0x01 << TIMRG_IM_ICOV_Pos)
#define TIMRG_IM_HALL_Pos			16
#define TIMRG_IM_HALL_Msk			(0x01 << TIMRG_IM_HALL_Pos)

#define TIMRG_OCEN_TIMR0_Pos		0
#define TIMRG_OCEN_TIMR0_Msk		(0x01 << TIMRG_OCEN_TIMR0_Pos)
#define TIMRG_OCEN_TIMR1_Pos		1
#define TIMRG_OCEN_TIMR1_Msk		(0x01 << TIMRG_OCEN_TIMR1_Pos)
#define TIMRG_OCEN_TIMR2_Pos		2
#define TIMRG_OCEN_TIMR2_Msk		(0x01 << TIMRG_OCEN_TIMR2_Pos)
#define TIMRG_OCEN_TIMR3_Pos		3
#define TIMRG_OCEN_TIMR3_Msk		(0x01 << TIMRG_OCEN_TIMR3_Pos)

#define TIMRG_OCMSK_TIMR0_Pos		0
#define TIMRG_OCMSK_TIMR0_Msk		(0x01 << TIMRG_OCMSK_TIMR0_Pos)
#define TIMRG_OCMSK_TIMR1_Pos		1
#define TIMRG_OCMSK_TIMR1_Msk		(0x01 << TIMRG_OCMSK_TIMR1_Pos)
#define TIMRG_OCMSK_TIMR2_Pos		2
#define TIMRG_OCMSK_TIMR2_Msk		(0x01 << TIMRG_OCMSK_TIMR2_Pos)
#define TIMRG_OCMSK_TIMR3_Pos		3
#define TIMRG_OCMSK_TIMR3_Msk		(0x01 << TIMRG_OCMSK_TIMR3_Pos)




